Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Extensions of a generic type can also include requirements that instances of the extended type must satisfy in order to gain the new functionality, as discussed in Extensions with a Generic Where Clause below.
ja: ある総称体型のそれぞれの拡張はまた、拡張された型のインスタンスが新しい機能性を獲得する手段として満たさなければならない要件を含むことができます、下の総称体where節を持つ拡張で議論されるように。

source: Extensions that add protocol conformance to a structure, enumeration, or class use the same keyword as the type they extend uses.
ja: プロトコル準拠を構造体、列挙、またはクラスに加える拡張それらは、同じキーワードをそれらが利用を拡張するところの型として使います。

source: Extensions that are in the same file as the class, structure, or enumeration that they extend behave as if the code in the extension had been written as part of the original type’s declaration.
ja: それが拡張するクラス、構造体、または列挙と同じファイルの中にある拡張は、まるでその拡張の中のコードがオリジナルの型の持つ宣言の一部として書かれたかのように振る舞います。

source: Extensions that provide a default implementation for a static subscript requirement use the static keyword.
ja: 静的添え字要件に省略時の実装を提供する拡張は、staticキーワードを使います。

source: Extensions that provide a default implementation for a type method requirement use the static keyword.
ja: 型メソッド要件に省略時の実装を提供する拡張は、staticキーワードを使います。

source: Extensions that provide a default implementation for a type property requirement use the static keyword.
ja: 型プロパティ要件に省略時の実装を提供する拡張は、staticキーワードを使います。

source: Extensions with a Generic Where Clause
ja: 総称体where節を持つ拡張

source: Failable Initializer Requirements
ja: 失敗できるイニシャライザ要件

source: Failable Initializers
ja: 失敗できるイニシャライザ

source: Failable Initializers for Enumerations
ja: 列挙のための失敗できるイニシャライザ

source: Failable Initializers for Enumerations with Raw Values
ja: 生の値を使う列挙のための失敗できるイニシャライザ

source: Fallthrough
ja: 抜け落ちる

source: Fallthrough Statement
ja: フォールスルー文

source: Finally, Residence defines an optional property called address, with a type of Address?.
ja: 最終的に、Residenceはaddressと呼ばれるオプショナルのプロパティを、Address?の型で定義します。

source: Finally, any convenience initializers in the chain have the option to customize the instance and to work with self.
ja: 最後に、連鎖の中のあらゆる便宜イニシャライザは、インスタンスを好みに合わせて作り変えるために、selfを扱うために選択肢を持ちます。

source: Finally, once the subclass’s designated initializer is finished, the convenience initializer that was originally called can perform additional customization.
ja: 最後に、一旦サブクラスの指定イニシャライザが作業をし終えるならば、最初に呼ばれた便宜イニシャライザは追加の特注処理を実行することができます。

source: Finally, the default case matches any other character.
ja: 最終的に、defaultケース節が他の文字のすべてにマッチします。

source: Finally, the blue component is obtained by performing a bitwise AND between the numbers 0xCC6699 and 0x0000FF, which gives an output value of 0x000099.
ja: 最後に、青の構成要素は数0xCC6699と0x0000FFとの間のビット単位の論理積を実行することによって得られます、それは、0x000099の出力値を与えます。

source: Finally, the overall minimum and maximum values are returned as a tuple of two Int values.
ja: 最後に、全体で最も小さいそして最も大きい値が２つのInt値のタプルとして返されます。

source: Find out whether a String value is empty by checking its Boolean isEmpty property:
ja: あるString値が空かどうかを、それのブールのisEmptyプロパティを調べることで確認してください：

source: First, it’s possible that dataSource may be nil, and so dataSource has a question mark after its name to indicate that increment(forCount:) should be called only if dataSource isn’t nil.
ja: 第１に、dataSourceがnilかもしれない可能性があります、なので、dataSourceはその名前の後に疑問符を持ち、dataSourceがnilでない場合にのみincrement(forCount:)が呼ばれるべきであるのを示します。

source: First, two classes called Person and Residence are defined:
ja: 最初に、PersonとResidence（個人と邸宅）と呼ばれる２つのクラスが定義されます：

source: First, you can add -1 to -4, simply by performing a standard binary addition of all eight bits (including the sign bit), and discarding anything that doesn’t fit in the eight bits once you’re done:
ja: 第１に、あなたは-1を-4に加えることが、単純に８つのビット全て（符号ビットを含む）の通常のバイナリの加算を実行して、あなたがそうしたならばその８ビットに収まらない何でも捨てることによって行えます：

source: Floating-Point Literals
ja: 浮動小数点リテラル

source: Floating-Point Numbers
ja: 浮動小数点数

source: Floating-point literals can be decimal (with no prefix), or hexadecimal (with a 0x prefix).
ja: 浮動小数点リテラルは、10進（接頭辞なし）、または16進（接頭辞0xつき）であることができます。

source: Floating-point literals can begin with leading zeros (0), but they’re likewise ignored and don’t affect the base or value of the literal.
ja: 浮動小数点リテラルは、いくつかのゼロ（0）を先頭に始まることができます、しかしそれらは同様に無視されて、リテラルの基数または値に影響を及ぼしません。

source: Floating-point to integer conversion must also be made explicit.
ja: 浮動小数点を整数に変換することは、また、明示的に行われる必要があります。

source: Floating-point types can represent a much wider range of values than integer types, and can store numbers that are much larger or smaller than can be stored in an Int.
ja: 浮動小数点型は、整数型よりずっと広い値の幅を表すことができ、そしてIntに格納できるよりずっと大きいまたは小さい数を格納できます。

source: Floating-point values are always truncated when used to initialize a new integer value in this way.
ja: この方法で新しい整数値を初期化するとき、浮動小数点値は常に切り詰められます。

source: For a complete list of precedence groups provided by the Swift standard library, see Operator Declarations [https://developer.apple.com/documentation/swift/operator_declarations].
ja: スウィフト標準ライブラリによって提供される優先順位グループの完全なリストとして、演算子宣言 [https://developer.apple.com/documentation/swift/operator_declarations]を見てください。

source: For a description of the Snakes and Ladders gameplay, see Break.
ja: ヘビとはしごのゲームプレイの解説として、Breakを見てください。

source: For a detailed discussion of the Swift standard library Array type, see Arrays.
ja: スウィフト標準ライブラリArray型の詳細な議論のために、配列を見てください。

source: For a detailed discussion of the Swift standard library Dictionary type, see Dictionaries.
ja: スウィフト標準ライブラリDictionary型の詳細な議論として、辞書を見てください。

source: For a detailed discussion of the behavior of in-out parameters and associated compiler optimizations, see In-Out Parameters.
ja: in-outパラメータの挙動と関連するコンパイラ最適化の詳細な議論として、in-outパラメータを見てください。

source: For a detailed discussion of the behavior of in-out parameters, see In-Out Parameters.
ja: in-outパラメータの振る舞いの詳細な議論のために、in-outパラメータを見てください。

source: For a dictionary that stores String values, for example, the method returns a value of type String?, or “optional String”.
ja: 例えば、String値を格納する辞書に対しては、このメソッドは型String?、すなわち「オプショナルのString」の値を返します。

source: For a discussion and several examples of classes that include various kinds of declarations, see Structures and Classes.
ja: 議論および、さまざまな種類の宣言を含むクラスの例のいくつかのために、構造体とクラスを見てください。

source: For a discussion and several examples of extensions that include various kinds of declarations, see Extensions.
ja: いろいろな種類の宣言を含む拡張の解説といくつかの例のために、拡張を見てください。

source: For a discussion and several examples of structures that include various kinds of declarations, see Structures and Classes.
ja: 議論および、さまざまな種類の宣言を含む構造体の例のいくつかのために、構造体とクラスを見てください。

source: For a discussion of nested functions, see Nested Functions.
ja: 入れ子にされた関数の議論のために、入れ子にされた関数を見てください。

source: For a generic function, that return type can use the function’s generic type parameters, but it must still be a single type.
ja: 総称体関数に対して、その戻り型は、関数のもつ総称体型パラメータを使用できます、しかしそれは依然として単一の型でなければなりません。

source: For a list of characters that can be used to define custom operators, see Operators.
ja: あつらえの演算子を定義するために使用できる文字のリストとして、演算子を見てください。

source: For a more detailed comparison, see Choosing Between Structures and Classes [https://developer.apple.com/documentation/swift/choosing_between_structures_and_classes].
ja: 詳細な比較は、構造体とクラスから選ぶ [https://developer.apple.com/documentation/swift/choosing_between_structures_and_classes]を見てください。

source: For a paragraph element, the closure would return "<p>some text</p>" or "<p />", depending on whether the text property equals "some text" or nil.
ja: 段落要素のために、このクロージャは、"<p>some text</p>"または"<p />"を返します、textプロパティが"some text"に等しいまたはnilかどうかに従って。

source: For a property marked with the NSManaged attribute, Core Data also provides the storage at runtime.
ja: NSManaged属性で印されるプロパティに対して、Coreデータはまたストレージを実行時に提供します。

source: For a protocol that inherits from another protocol, you add a constraint to an inherited associated type by including the generic where clause in the protocol declaration.
ja: 別のプロトコルから継承するプロトコルに対して、あなたは継承された関連型への制約の追加を、総称体where節をそのプロトコル宣言の中で含めることによって行います。

source: For a type that is defined as public, the default initializer is considered internal.
ja: publicとして定義される型のために、その省略時のイニシャライザは内部と見なされます。

source: For an alternative way to write this example without defining the init() and init(origin:size:) initializers yourself, see Extensions.
ja: init()とinit(origin:size:)イニシャライザをあなた自身で定義することなくこの例を書く代わりの方法のために、拡張を見てください。

source: For an example and more information about the unowned modifier, see Unowned References.
ja: unowned修飾子についての例とさらなる情報として、非所有参照を見てください。

source: For an example and more information about the weak modifier, see Weak References.
ja: weak修飾子についての例と更なる情報のために、弱い参照を見てください。

source: For an example of an autoclosure function type parameter, see Autoclosures.
ja: 自動クロージャ関数型パラメータの例として、自動クロージャを見てください。

source: For an example of an enumeration definition that uses a type inheritance clause to specify the type of its raw values, see Raw Values.
ja: その生の値の型を指定するために型継承節を使う列挙定義の例のために、生の値を見てください。

source: For an example of how to use a fallthrough statement in a switch statement, see Control Transfer Statements in Control Flow.
ja: fallthrough文をswitch文において使う方法の例のために、制御移動文を章制御の流れで見てください。

source: For an example of how to use a throw statement, see Propagating Errors Using Throwing Functions in Error Handling.
ja: throw文を使う方法の例のために、スロー関数を使ってエラーを伝えるをエラー処理の章で見てください。

source: For an example of how to use a deinitializer in a class declaration, see Deinitialization.
ja: クラス宣言においてデイニシャライザを使う方法の例のために、デイニシャライズを見てください。

source: For an example of how to use protocol inheritance, see Protocol Inheritance.
ja: プロトコル継承を使う方法の例のために、プロトコル継承を見てください。

source: For an example of how to use the autoclosure attribute, see Autoclosures and Function Type.
ja: autoclosure属性を使用する方法の例として、自動クロージャと関数型を見てください。

source: For an example of how to use the final attribute, see Preventing Overrides.
ja: final属性を使う方法の例として、オーバーライドを防ぐを見てください。

source: For an example of how to use the lazy modifier, see Lazy Stored Properties.
ja: lazy修飾子を使う方法の例として、遅延格納プロパティを見てください。

source: For an example of how to use the unknown attribute, see Switching Over Future Enumeration Cases.
ja: unknown属性を使う方法の例のために、未来列挙ケース節に対してスイッチするを見てください。

source: For an example of how to use the escaping attribute, see Escaping Closures.
ja: escaping属性を使う方法の例として、脱出クロージャを見てください。

source: For an example that demonstrates both of these features, see Functions with Multiple Return Values.
ja: これらの特徴の両方を示す例のために、複数の戻り値をもつ関数を見てください。

source: For an example that uses a switch statement to match enumeration cases containing associated values, see Associated Values.
ja: 関連値を含んでいる列挙ケース節にマッチするためにswitch文を使う例のために、関連値を見てください。

source: For an example that uses a switch statement to match values with is and as patterns, see Type Casting for Any and AnyObject.
ja: switch文を使用して、さまざまに値をisやasパターンとマッチする例のために、AnyおよびAnyObjectに対する型キャストを見てください。

source: For an example that uses a variadic parameter, see Variadic Parameters.
ja: 可変長パラメータを使う例のために、可変長パラメータを見てください。

source: For an example that uses the ternary conditional operator, see Ternary Conditional Operator.
ja: 三項条件演算子を使用する例のために、三項条件演算子を見てください。

source: For an extended discussion and several examples of class inheritance, see Inheritance.
ja: クラス継承の広範囲にわたる議論といくつかの例のために、継承を見てください。

source: For an overview of generics in Swift, see Generics.
ja: スウィフトでの総称体の概要のために、総称体を見てください。

source: For both signed and unsigned integers, overflow in the positive direction wraps around from the maximum valid integer value back to the minimum, and overflow in the negative direction wraps around from the minimum value to the maximum.
ja: 符号つきおよび符号なし整数の両方に対して、正の方向でのオーバフローは最大限の有効な整数値から逆に最小限へとぐるっと送り込まれ、負の方向でのオーバフローは最小限の値から最大限へとぐるっと送り込まれます。

source: For brevity, multiple values are covered in a single switch case.
ja: 簡潔にするため、複数の値が１つのswitchケース節で扱われます。

source: For characters in strings, “greater than” means “appears later in the alphabet than”.
ja: 文字列の中の文字のために、「より大きい」は「アルファベットにおいてより後に現れる」ことを意味します。

source: For class instances, a constant property can be modified during initialization only by the class that introduces it.
ja: クラスインスタンスのために、定数プロパティは、それを導入するクラスによってのみ初期化の間に修正されることができます。

source: For class instances, the initializer that’s called must be marked with the required keyword or the entire class marked with the final keyword.
ja: クラスインスタンスに対しては、呼び出されるイニシャライザがrequiredキーワードで印されるか、クラス全体がfinalキーワードで印されなければなりません。

source: For classes that are defined in another module, you can override any open class member.
ja: 別のモジュールにおいて定義されるクラスに対して、あなたはどんな開放クラスメンバーでもオーバーライドできます。

source: For computed type properties for class types, you can use the class keyword instead to allow subclasses to override the superclass’s implementation.
ja: クラス型のための計算型プロパティに対しては、あなたは代わりにclassキーワードを使って、サブクラスにそのスーパークラスの実装のオーバーライドを許可することができます。

source: For convenience and because the distinction isn’t that important in Swift, the term declaration covers both declarations and definitions.
ja: 便利さとその区別がスウィフトにおいてそんなに重要でないことから、用語宣言は、宣言と定義を含みます。

source: For decimal numbers with an exponent of exp, the base number is multiplied by 10exp:
ja: expの指数を持つある10進数に対して、その基数は10expを掛けられます：

source: For details, see Break in a Switch Statement.
ja: 詳細はスイッチ文の中断を見てください。

source: For each entry in the capture list, a constant is initialized to the value of the constant or variable that has the same name in the surrounding scope.
ja: キャプチャリストのそれぞれの登録項目に対して、その定数や変数の値へとひとつの定数が初期化されます、それは囲んでいるスコープの中で同じ名前を待ちます。

source: For each integer in the array, the function considers the kind computed property for that integer, and prints an appropriate description.
ja: その配列の各整数に対して、この関数はその整数に対するkind計算プロパティを考慮して、適切な説明を出力します。

source: For each item in the array, the enumerated() method returns a tuple composed of an integer and the item.
ja: この配列の各項目に対して、enumerated()メソッドは、整数とその項目から成るひとつのタプルを返します。

source: For each item, the function checks whether the item from someContainer isn’t equal to the corresponding item in anotherContainer.
ja: 各項目のために、関数はsomeContainerからの項目がanotherContainerでの対応する項目と同等でないかどうか確認します。

source: For example in the code below, a is included in the capture list but b is not, which gives them different behavior.
ja: 例えば以下のコードにおいて、aはキャプチャリストに含まれますがbはそうではありません、そのことはそれらに異なる挙動を与えます。

source: For example, ((Int, Int)) -> Void is the type of a function that takes a single parameter of the tuple type (Int, Int) and doesn’t return any value.
ja: 例えば、((Int, Int)) -> Voidは、タプル型(Int, Int)の単一のパラメータを取り、何ら値を返さない関数の型です。

source: For example, (Int) is equivalent to Int.
ja: 例えば、(Int)はIntに等しいです。

source: For example, (a: 10, a: 20) is invalid because the label a appears twice at the same level.
ja: 例えば、(a: 10, a: 20)は無効です、なぜならラベルaが同じ水準で二度現れるからです。

source: For example, Int is a type identifier that directly refers to the named type Int, and the type identifier Dictionary<String, Int> directly refers to the named type Dictionary<String, Int>.
ja: 例えば、Intは、直接に名前付きの型Intに言及する型識別子です、そして型識別子Dictionary<String, Int>は、直接に名前付きの型Dictionary<String, Int>に言及します。

source: For example, LATIN SMALL LETTER E WITH ACUTE (U+00E9) is canonically equivalent to LATIN SMALL LETTER E (U+0065) followed by COMBINING ACUTE ACCENT (U+0301).
ja: 例えば、LATIN SMALL LETTER E WITH ACUTE（U+00E9）は、LATIN SMALL LETTER E（U+0065）にCOMBINING ACUTE ACCENT（U+0301）を続けたものと正準等価です。

source: For example, UInt64(0xffff_ffff_ffff_ffff) evaluates to the correct value rather than overflowing.
ja: 例えば、UInt64(0xffff_ffff_ffff_ffff)は正しい値に評価されます、オーバーフローするのではなくて。

source: For example, Int8 conforms to the ExpressibleByIntegerLiteral protocol, and therefore it can be used in the type annotation for the integer literal 42 in the declaration let x: Int8 = 42.
ja: 例えば、Int8はExpressibleByIntegerLiteralプロトコルに準拠します、したがってそれは宣言let x: Int8 = 42の中の整数リテラル42のための型注釈において使われることができます。

source: For example, <S: Sequence> where S.Iterator.Element: Equatable specifies that S conforms to the Sequence protocol and that the associated type S.Iterator.Element conforms to the Equatable protocol.
ja: 例えば、<S: Sequence> where S.Iterator.Element: Equatableが指定するのは、SがSequenceプロトコルに準拠すること、そして関連型S.Iterator.ElementがEquatableプロトコルに準拠することです。

source: For example, x.self evaluates to x.
ja: 例えば、x.selfはxに評価されます。

source: For example, .+. is treated as a single operator.
ja: 例えば、.+.は単一の演算子とみなされます。

source: For example, <S1: Sequence, S2: Sequence> where S1.Iterator.Element == S2.Iterator.Element expresses the constraints that S1 and S2 conform to the Sequence protocol and that the elements of both sequences must be of the same type.
ja: 例えば、<S1: Sequence, S2: Sequence> where S1.Iterator.Element == S2.Iterator.Elementが表す制約は、S1とS2がSequenceプロトコルに準拠すること、そして両方のシーケンスの要素が同じ型でなければならないということです。

source: For example, SomeClass.self returns SomeClass itself, not an instance of SomeClass.
ja: 例えば、SomeClass.selfは、SomeClass自身を返します、SomeClassのインスタンスではなく。

source: For example, class is not a valid identifier, but `class` is valid.
ja: 例えば、classは有効な識別子ではありません、しかし、`class`は有効です。

source: For example, +.+ is treated as the + operator followed by the .+ operator.
ja: 例えば、+.+は、+演算子に.+演算子が続くとみなされます。

source: For example, 0xFp2 represents 15 x 22, which evaluates to 60.
ja: 例えば、0xFp2は15 × 22を表します、それは60に評価されます。

source: For example, 1.25e2 represents 1.25 x 102, which evaluates to 125.0.
ja: 例えば、1.25e2は1.25 × 102を表します、それは125.0に評価されます。

source: For example, Hangul syllables from the Korean alphabet can be represented as either a precomposed or decomposed sequence.
ja: 例えば、コリアン・アルファベットのハングル音節は、最初から組み立てられるか、または分解されて並べたもののどちらでも表わすことが出来ます。

source: For example, Swift ensures that variables are initialized before they’re used, memory isn’t accessed after it’s been deallocated, and array indices are checked for out-of-bounds errors.
ja: 例えば、変数はそれらが使用される前に初期化されること、メモリはそれがデアロケートされてしまった後にアクセスされないこと、そして配列インデックスは境界外エラーを調べられることを、スウィフトは確実にします。

source: For example, Swift’s Dictionary type implements a subscript to set and retrieve the values stored in a Dictionary instance.
ja: 例えば、スウィフトのDictionary型は、Dictionaryインスタンスに格納される値を設定したり取り出すために添え字を実装します。

source: For example, Swift’s Dictionary type places a limitation on the types that can be used as keys for a dictionary.
ja: 例えば、スウィフトのDictionary型は、辞書のキーとして使われることができる型に制限を置きます。

source: For example, Swift’s Array and Dictionary types are both generic collections.
ja: 例えば、スウィフトのArrayとDictionary型は、両方とも総称体コレクションです。

source: For example, a control expression matches the case in the example below only if it is a tuple that contains two elements of the same value, such as (1, 1).
ja: 例えば、ある制御式は、それが同じ値の２つの要素を持つタプル、例えば(1, 1)のようなものである場合にのみ、以下の例におけるケース節にマッチします。

source: For example, a case named venus in a Swift Planet enumeration is exposed to Objective-C code as a case named PlanetVenus.
ja: 例えば、スウィフトのPlanet列挙の中のvenusと名付けられるケース節は、Objective-CコードにPlanetVenusと名付けられるケース節として暴露されます。

source: For example, a function someFunction<T>() could return a value of type T or Dictionary<String, T>.
ja: 例えば、関数someFunction<T>()は、型TまたはDictionary<String, T>の値を返すことができました。

source: For example, a method of type (Int) -> String becomes ((Int) -> String)?.
ja: 例えば、型(Int) -> Stringのメソッドは((Int) -> String)?になります。

source: For example, a private type alias can alias a private, file-private, internal, public, or open type, but a public type alias can’t alias an internal, file-private, or private type.
ja: 例えば、非公開の型エイリアスは、非公開、ファイル外非公開、内部、公開、または開放型のエイリアス（別名）となることができます、しかし公開型エイリアスは、内部、ファイル外非公開、または非公開型をエイリアスできません。

source: For example, a variadic parameter with a name of numbers and a type of Double... is made available within the function’s body as a constant array called numbers of type [Double].
ja: 例えば、numbersの名前とDouble...の型を持つある可変長パラメータは、関数の本文内で型[Double]のnumbersと呼ばれるある定数配列として利用可能にされます。

source: For example, all of the following string literals have the same value:
ja: 例えば、以下の文字列リテラルの全ては、同じ値を持ちます：

source: For example, all the read and write accesses in the code listing below are instantaneous:
ja: 例えば、以下のコード出力での全ての読み出しおよび書き込みアクセスは即時的です：

source: For example, as demonstrated in the code below, you can compare two tuples of type (String, Int) because both String and Int values can be compared using the < operator.
ja: 例えば、下のコードで実演されるように、あなたは型(String, Int)の２つのタプルを比較できます、なぜならStringとIntの値の両方とも<演算子を使って比較できるからです。

source: For example, because SomeClass.self evaluates to the SomeClass type itself, you can pass it to a function or method that accepts a type-level argument.
ja: 例えば、SomeClass.selfはSomeClass型それ自体に評価されるので、あなたはそれを型レベルの引数を受け入れる関数またはメソッドへ渡すことができます。

source: For example, both functions below have the same behavior:
ja: 例えば、下の両方の関数は同じ挙動を持ちます：

source: For example, consider a game where each player has a health amount, which decreases when taking damage, and an energy amount, which decreases when using special abilities.
ja: 例えば、あるゲームを考えてください、そこにおいて各プレイヤーはダメージを受ける場合に減少する体力量、そして特別な能力を使う場合に減少するエネルギー量を持ちます。

source: For example, consider the case of requesting the sunrise and sunset times from a server.
ja: 例えば、日の出と日没の時間をあるサーバーに要請する場合を考えてください。

source: For example, given the following simple protocol:
ja: 例えば、以下の簡単なプロトコルを与えられて：

source: For example, here is an enumeration that stores simple arithmetic expressions:
ja: 例えば、ここに単純な算術式を格納する列挙があります：

source: For example, here’s a function that evaluates an arithmetic expression:
ja: 例えば、ここに算術式の数値を求める関数があります：

source: For example, here’s a protocol that refines the Container protocol, adding the requirement of a suffix(_:) method.
ja: 例えば、ここにContainerプロトコルを改良したプロトコルがあり、suffix(_:)メソッドという要件を追加しています。

source: For example, here’s a version of SmallRectangle from the previous code listing that wraps its properties in the TwelveOrLess structure explicitly, instead of writing @TwelveOrLess as an attribute:
ja: 例えば、ここに前のコード出力からのSmallRectangleの変形版があります、それはそれのプロパティをTwelveOrLess構造体の中に明示的にラップします、@TwelveOrLessを属性として書く代わりに。

source: For example, here’s a version of flip(_:) that uses a protocol type as its return type instead of an opaque return type:
ja: 例えば、ここにflip(_:)のあるバージョンがあります、それはあるプロトコル型をそれの戻り型として使います、不透明戻り型の代わりに：

source: For example, here’s a version of the Container protocol from Generics:
ja: 例えば、ここに総称体からの、Containerプロトコルのあるバージョンがあります：

source: For example, here’s an invalid version of the shape-flipping function that includes a special case for squares:
ja: 例えば、ここに形状反転関数の無効なバージョンがあります、それは正方形に対する特別な場合を含みます：

source: For example, here’s an extension to the nongeneric IntStack type that adds SuffixableContainer conformance, using Stack<Int> as its suffix type instead of IntStack:
ja: 例えば、ここに非総称体IntStack型に対する拡張があります、それはSuffixableContainer準拠を、Stack<Int>をそれのsuffix型としてIntStackの代わりに使って追加します：

source: For example, here’s how you might represent the error conditions of operating a vending machine inside a game:
ja: 例えば、ここにあなたが表すかもしれないあるゲーム内の自動販売機操作のエラー状況がどのようなものかがあります：

source: For example, if balance(_:_:) was an operator function named <^>, writing playerOneScore <^> playerOneScore would result in the same conflict as balance(&playerOneScore, &playerOneScore).
ja: 例えば、balance(_:_:)が<^>という名前の演算子関数であったならば、書き込みplayerOneScore <^> playerOneScoreは、balance(&playerOneScore, &playerOneScore)と同じ衝突という結果になるでしょう。

source: For example, if a public type conforms to an internal protocol, the type’s implementation of each protocol requirement must be at least internal.
ja: 例えば、ある公開型が内部プロトコルに準拠するならば、その型の持つ各プロトコル要件の実装は、少なくとも内部でなければなりません。

source: For example, if a type is public, but a protocol it conforms to is internal, the type’s conformance to that protocol is also internal.
ja: 例えば、ある型が公開である、しかしそれが準拠するプロトコルは内部であるならば、その型のもつそのプロトコルに対する準拠もまた内部です。

source: For example, if the variable holly in the example above is changed to a local variable instead of a global variable, the compiler can prove that overlapping access to stored properties of the structure is safe:
ja: 例えば、変数hollyが上の例においてグローバル変数ではなくローカル変数に変更されるならば、コンパイラは構造体に属する格納プロパティへのオーバーラッブするアクセスが安全であることを立証できます。
